#!/usr/bin/env bash
ln -s $HOME/vd/bin $HOME/bin
source ${HOME}/vd/bin/utils.sh || exit 1
clear
echo
echo "  ██╗   ██╗██████╗       ███████╗███████╗████████╗██╗   ██╗██████╗ "
echo "  ██║   ██║██╔══██╗      ██╔════╝██╔════╝╚══██╔══╝██║   ██║██╔══██╗"
echo "  ██║   ██║██║  ██║█████╗███████╗█████╗     ██║   ██║   ██║██████╔╝"
echo "  ╚██╗ ██╔╝██║  ██║╚════╝╚════██║██╔══╝     ██║   ██║   ██║██╔═══╝ "
echo "   ╚████╔╝ ██████╔╝      ███████║███████╗   ██║   ╚██████╔╝██║     "
echo "    ╚═══╝  ╚═════╝       ╚══════╝╚══════╝   ╚═╝    ╚═════╝ ╚═╝     "
echo "                                                                   "
echo " Setup for vD has started! "
echo " - Setting scripts path..."
export PATH=$HOME/bin:$PATH
echo 'source $HOME/bin/utils.sh' >> $HOME/.bashrc
_vd_setup_golang
_vd_setup_base16colors
_vd_setup_default_editor
_vd_setup_install_tmux_dotfiles
_vd_setup_install_vim_dotfile_plugins
_vd_setup_install_zsh_plugins
_vd_setup_gpg
_vd_setup_logo
/usr/bin/zsh
